class 柴油仿真结果导出单位:
    柴油消耗量 = "L"
    柴油消耗费用 = "万元"


class 电负荷仿真结果导出单位:
    时间 = "one"
    耗电功率 = "kW"


class 光伏发电仿真结果导出单位:
    时间 = "one"
    发电功率 = "kW"


class 风力发电仿真结果导出单位:
    时间 = "one"
    发电功率 = "kW"


class 柴油发电仿真结果导出单位:
    时间 = "one"
    发电功率 = "kW"


class 锂电池仿真结果导出单位:
    时间 = "one"
    荷电容量 = "kWh"
    荷电状态 = "percent"
    电功率 = "kW"


class 变压器仿真结果导出单位:
    时间 = "one"
    转换功率 = "kW"


class 变流器仿真结果导出单位:
    时间 = "one"
    转换功率 = "kW"


class 双向变流器仿真结果导出单位:
    时间 = "one"
    转换功率 = "kW"


class 传输线仿真结果导出单位:
    时间 = "one"
    传输功率 = "kW"
