from log_utils import logger_print


class 柴油仿真结果导出单位:
    柴油消耗量 = "L"
    柴油消耗费用 = "万元"


class 电负荷仿真结果导出单位:
    电负荷 = "kWh"
    电收入 = "万元"


class 光伏发电仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    产电量 = "kWh"


class 风力发电仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    产电量 = "kWh"


class 柴油发电仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    产电量 = "kWh"
    柴油消耗量 = "L"
    平均效率_平均COP = "one"


class 锂电池仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    平均效率_平均COP = "one"


class 变压器仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    平均效率_平均COP = "one"


class 变流器仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    平均效率_平均COP = "one"


class 双向变流器仿真结果导出单位:
    设备台数 = "one"
    设备维护费用 = "万元"
    平均效率_平均COP = "one"


class 传输线仿真结果导出单位:
    设备维护费用 = "万元"
    平均效率_平均COP = "one"
